In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from persiantools.jdatetime import JalaliDate

# Create DataFrame

In [59]:
my_dict = {'color': ['red', 'blue', 'black'], 'density': [2, 8, 9]}
my_dict

{'color': ['red', 'blue', 'black'], 'density': [2, 8, 9]}

In [60]:
pd.DataFrame(my_dict)

   color  density
0    red        2
1   blue        8
2  black        9

In [61]:
Name = ['Tom', 'Krish', 'Nick']
age = [25, 36, 8]
New = list(zip(Name, age))
New

[('Tom', 25), ('Krish', 36), ('Nick', 8)]

In [62]:
df = pd.DataFrame(New, columns=['name', 'age'], index=['row1', 'row2', 'row3'])
df

       name  age
row1    Tom   25
row2  Krish   36
row3   Nick    8

# Pandas versus Numpy

In [63]:
a = np.array([1, 5, 9, 87]) # Modify type --> all
print(a)

[ 1  5  9 87]

In [64]:
df.name

row1      Tom
row2    Krish
row3     Nick
Name: name, dtype: object

# Read a local file

In [4]:
df = pd.read_excel('COVID-19-geographic-disbtribution-worldwide.xlsx')
df.head(10)

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000
0,2020-12-04,4,12,2020,119,5,Afghanistan,AF,AFG,38041757.0,Asia,7.107979
1,2020-12-03,3,12,2020,202,19,Afghanistan,AF,AFG,38041757.0,Asia,7.536455
2,2020-12-02,2,12,2020,400,48,Afghanistan,AF,AFG,38041757.0,Asia,7.005460
3,2020-12-01,1,12,2020,272,11,Afghanistan,AF,AFG,38041757.0,Asia,6.960772
4,2020-11-30,30,11,2020,0,0,Afghanistan,AF,AFG,38041757.0,Asia,6.416633
5,2020-11-29,29,11,2020,228,11,Afghanistan,AF,AFG,38041757.0,Asia,6.845110
6,2020-11-28,28,11,2020,214,15,Afghanistan,AF,AFG,38041757.0,Asia,6.784650
7,2020-11-27,27,11,2020,0,0,Afghanistan,AF,AFG,38041757.0,Asia,6.395604
8,2020-11-26,26,11,2020,200,12,Afghanistan,AF,AFG,38041757.0,Asia,7.341932
9,2020-11-25,25,11,2020,185,13,Afghanistan,AF,AFG,38041757.0,Asia,7.199983

In [66]:
df.shape[0]

59770

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59770 entries, 0 to 59769
Data columns (total 12 columns):
 #   Column                                                      Non-Null Count  Dtype
---  ------                                                      --------------  -----
 0   dateRep                                                     59770 non-null  datetime64[ns]
 1   day                                                         59770 non-null  int64
 2   month                                                       59770 non-null  int64
 3   year                                                        59770 non-null  int64
 4   cases                                                       59770 non-null  int64
 5   deaths                                                      59770 non-null  int64
 6   countriesAndTerritories                                     59770 non-null  object
 7   geoId                                                       59505 non-null  object
 8   countryterritoryCode                                        59657 non-null  object
 9   popData2019                                                 59657 non-null  float64
 10  continentExp                                                59770 non-null  object
 11  Cumulative_number_for_14_days_of_COVID-19_cases_per_100000  56901 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(5), object(4)
memory usage: 5.5+ MB

# Select an index or column

In [68]:
df['countriesAndTerritories']

0        Afghanistan
1        Afghanistan
2        Afghanistan
3        Afghanistan
4        Afghanistan
            ...
59765       Zimbabwe
59766       Zimbabwe
59767       Zimbabwe
59768       Zimbabwe
59769       Zimbabwe
Name: countriesAndTerritories, Length: 59770, dtype: object

In [5]:
df_ir = df[df['countriesAndTerritories'] == 'Iran']
df_ir.tail(4)

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000
26843,2020-01-03,3,1,2020,0,0,Iran,IR,IRN,82913893.0,Asia,NaN
26844,2020-01-02,2,1,2020,0,0,Iran,IR,IRN,82913893.0,Asia,NaN
26845,2020-01-01,1,1,2020,0,0,Iran,IR,IRN,82913893.0,Asia,NaN
26846,2019-12-31,31,12,2019,0,0,Iran,IR,IRN,82913893.0,Asia,NaN

# Selection by label

In [70]:
df_ir.loc[24554:24558, 'dateRep': 'deaths']

Empty DataFrame
Columns: [dateRep, day, month, year, cases, deaths]
Index: []

# Selection by position

In [71]:
df_ir.iloc[:5, 1:4]

       day  month  year
26507    4     12  2020
26508    3     12  2020
26509    2     12  2020
26510    1     12  2020
26511   30     11  2020

In [72]:
df_ir[df_ir.cases > 3000] # Boolian

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000
26507,2020-12-04,4,12,2020,13922,358,Iran,IR,IRN,82913893.0,Asia,243.143812
26508,2020-12-03,3,12,2020,13621,362,Iran,IR,IRN,82913893.0,Asia,226.352898
26509,2020-12-02,2,12,2020,13881,382,Iran,IR,IRN,82913893.0,Asia,226.111684
26510,2020-12-01,1,12,2020,13321,371,Iran,IR,IRN,82913893.0,Asia,225.473673
26511,2020-11-30,30,11,2020,12950,389,Iran,IR,IRN,82913893.0,Asia,225.150446
...,...,...,...,...,...,...,...,...,...,...,...,...
26691,2020-06-03,3,6,2020,3117,64,Iran,IR,IRN,82913893.0,Asia,39.750877
26750,2020-04-05,5,4,2020,5275,292,Iran,IR,IRN,82913893.0,Asia,42.372875
26754,2020-04-01,1,4,2020,3111,141,Iran,IR,IRN,82913893.0,Asia,34.297027
26755,2020-03-31,31,3,2020,3186,117,Iran,IR,IRN,82913893.0,Asia,31.965692
26757,2020-03-29,29,3,2020,3076,139,Iran,IR,IRN,82913893.0,Asia,27.352473

# Where method

In [9]:
df_ir.where(df_ir.cases > 3000) # Return Nan other values or zero

,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,Cumulative_number_for_14_days_of_COVID-19_cases_per_100000
26507,2020-12-04,4.0,12.0,2020.0,13922.0,358.0,Iran,IR,IRN,82913893.0,Asia,243.143812
26508,2020-12-03,3.0,12.0,2020.0,13621.0,362.0,Iran,IR,IRN,82913893.0,Asia,226.352898
26509,2020-12-02,2.0,12.0,2020.0,13881.0,382.0,Iran,IR,IRN,82913893.0,Asia,226.111684
26510,2020-12-01,1.0,12.0,2020.0,13321.0,371.0,Iran,IR,IRN,82913893.0,Asia,225.473673
26511,2020-11-30,30.0,11.0,2020.0,12950.0,389.0,Iran,IR,IRN,82913893.0,Asia,225.150446
...,...,...,...,...,...,...,...,...,...,...,...,...
26842,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26843,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26844,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26845,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26846,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Add an new column

In [ ]:
df_ir['ratio'] = df_ir['deaths']/df_ir['cases']
df_ir.insert(1, 'ratio_percent', df_ir.ratio*100)
df_ir

# Delete a Column

In [ ]:
df_ir.drop(['ratio_percent', 'ratio'], axis=1, inplace=True) # inplace for getting on dataframe

In [ ]:
df_ir.rename(columns={'Cumulative_number_for_14_days_of_COVID-19_cases_per_100000': 'CNC'}, inplace=True)

# Save DataFrame

In [ ]:
df_ir.to_csv('Iran_COVID.csv')

In [74]:
df = pd.read_csv('Iran_COVID.csv')
df.head(3)

,Unnamed: 0,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,CNC
0,26507,2020-12-04,4,12,2020,13922,358,Iran,IR,IRN,82913893.0,Asia,243.143812
1,26508,2020-12-03,3,12,2020,13621,362,Iran,IR,IRN,82913893.0,Asia,226.352898
2,26509,2020-12-02,2,12,2020,13881,382,Iran,IR,IRN,82913893.0,Asia,226.111684

In [ ]:
df.drop(['Unnamed: 0', 'countriesAndTerritories', 'geoId', 'countryterritoryCode', 'popData2019', 'continentExp', 'CNC'], axis=1, inplace=True)
df.head()

In [ ]:
# Repeated Data
df.loc[df.duplicated(subset=['deaths', 'cases'], keep=False)] # first: Keep first values, 'last': keep last
df.loc[df.duplicated(keep=False)] # Totally

# Drop using index
df.drop(df.loc[df.duplicated(keep='first')].index)

# 
df.drop_duplicates(keep='first', inplace=True, ignore_index=True)

In [75]:
df.cases.sum()
df.sum(axis=0)
df.count() # Non NAN counts
df.shape

(340, 13)

In [ ]:
df.cumsum()

In [ ]:
plt.plot(df.cases.cumsum(skipna=True)) # jumping from nan values ---- return all of vlues in nan form after nan valeus
df.cases.max()
df.cases.idxmax()
df.deaths.mean()
df.deaths.median()
df.describe()

In [ ]:
# Percent Change : Change
df.deaths.pct_change()
plt.plot(df.deaths.pct_change(periods=30))

In [ ]:
df.corr()
plt.scatter(df.cases, df.deaths)

In [ ]:
df.dateRep[0]
JalaliDate.to_jalali(2020, 11, 13)

def my_function(in_str):
    year = int(in_str[:4])
    month = int(in_str[5:7])
    day = int(in_str[7:])
    return JalaliDate.to_jalali(year, month, day)

df.dateRep.apply(my_function)
df.dateRep.apply(lambda in_str: JalaliDate.to_jalali(int(in_str[:4]), int(in_str[5:7]), int(in_str[7:]))) # It is done just in one line

# Missing values:
1) user error
2) coding error
3) Trasferring data

NaN: Type float 
missing values: None  Type Nonetype

In [7]:
print(type(np.nan))
type(None)

<class 'float'>

NoneType

# Missing Data casting rules

In [87]:
Name = ['Tom', 'Nick', '?']
Graduated = [True, True, False]
Height = [1.8, 1.62, 1.02]
age = [25, 36, 8]

s = pd.Series(['1/18/1995', '5/12/1984', '7/23/2012'])
date = pd.to_datetime(s)

New = list(zip(date, Name, age, Graduated, Height))

df = pd.DataFrame(New, columns=['date', 'name', 'age', 'graduated', 'height'])
display(df)
display(df.dtypes)
df.loc[2] = np.nan
display(df)
display(df.dtypes)

        date  name  age  graduated  height
0 1995-01-18   Tom   25       True    1.80
1 1984-05-12  Nick   36       True    1.62
2 2012-07-23     ?    8      False    1.02

date         datetime64[ns]
name                 object
age                   int64
graduated              bool
height              float64
dtype: object

        date  name   age  graduated  height
0 1995-01-18   Tom  25.0        1.0    1.80
1 1984-05-12  Nick  36.0        1.0    1.62
2        NaT   NaN   NaN        NaN     NaN

date         datetime64[ns]
name                 object
age                 float64
graduated           float64
height              float64
dtype: object

# NA

In [10]:
pd.Series([1, 2, np.nan, 4], dtype=pd.Int64Dtype())

0       1
1       2
2    <NA>
3       4
dtype: Int64

# Detecting Missing values

In [76]:
df.isnull()
df.isna()
df.notna()
df.notnull()

,Unnamed: 0,dateRep,day,month,year,cases,deaths,countriesAndTerritories,geoId,countryterritoryCode,popData2019,continentExp,CNC
0,True,True,True,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
335,True,True,True,True,True,True,True,True,True,True,True,True,False
336,True,True,True,True,True,True,True,True,True,True,True,True,False
337,True,True,True,True,True,True,True,True,True,True,True,True,False
338,True,True,True,True,True,True,True,True,True,True,True,True,False
339,True,True,True,True,True,True,True,True,True,True,True,True,False

In [86]:
df.type()

AttributeError: 'DataFrame' object has no attribute 'type'

# Replace unrelated values

In [77]:
df = pd.read_csv('team.csv')
display(df)
df.replace({'?': np.nan, '_': np.nan}, inplace=True)
display(df)

           name  gender start_date    salary   bonus senior_management team
0        Thomas    Male  3/31/1996   61933.0    4.17              TRUE    ?
1        Louise  Female  8/12/1980   63241.0       _              TRUE  NaN
2             ?    Male  6/14/2012  125792.0   5.042               NaN  NaN
3             ?    Male  8/21/1998  122340.0   6.417               NaN  NaN
4         James     NaN  1/26/2005  128771.0   8.309             FALSE  NaN
5           NaN     NaN        NaN       NaN     NaN                 _  NaN
6   Christopher    Male  4/22/2000   37919.0     NaN             FALSE  NaN
7           NaN  Female  10/3/1990  132373.0  11.449               NaN  NaN
8      Jonathan    Male  7/17/2009  130581.0     NaN              TRUE  NaN
9       Michael    Male  1/24/2002   43586.0  12.659             FALSE  NaN
10       Jeremy    Male  6/14/1988  129460.0  13.657              TRUE  NaN

           name  gender start_date    salary   bonus senior_management  team
0        Thomas    Male  3/31/1996   61933.0    4.17              TRUE   NaN
1        Louise  Female  8/12/1980   63241.0     NaN              TRUE   NaN
2           NaN    Male  6/14/2012  125792.0   5.042               NaN   NaN
3           NaN    Male  8/21/1998  122340.0   6.417               NaN   NaN
4         James     NaN  1/26/2005  128771.0   8.309             FALSE   NaN
5           NaN     NaN        NaN       NaN     NaN               NaN   NaN
6   Christopher    Male  4/22/2000   37919.0     NaN             FALSE   NaN
7           NaN  Female  10/3/1990  132373.0  11.449               NaN   NaN
8      Jonathan    Male  7/17/2009  130581.0     NaN              TRUE   NaN
9       Michael    Male  1/24/2002   43586.0  12.659             FALSE   NaN
10       Jeremy    Male  6/14/1988  129460.0  13.657              TRUE   NaN

In [19]:
missing_values = ['?', '_']
df = pd.read_csv('team.csv', na_values=missing_values)
df

           name  gender start_date    salary   bonus senior_management  team
0        Thomas    Male  3/31/1996   61933.0   4.170              True   NaN
1        Louise  Female  8/12/1980   63241.0     NaN              True   NaN
2           NaN    Male  6/14/2012  125792.0   5.042               NaN   NaN
3           NaN    Male  8/21/1998  122340.0   6.417               NaN   NaN
4         James     NaN  1/26/2005  128771.0   8.309             False   NaN
5           NaN     NaN        NaN       NaN     NaN               NaN   NaN
6   Christopher    Male  4/22/2000   37919.0     NaN             False   NaN
7           NaN  Female  10/3/1990  132373.0  11.449               NaN   NaN
8      Jonathan    Male  7/17/2009  130581.0     NaN              True   NaN
9       Michael    Male  1/24/2002   43586.0  12.659             False   NaN
10       Jeremy    Male  6/14/1988  129460.0  13.657              True   NaN

# Handling missing values

#1 Removing :
 Num of data is enough high to nan's count

In [23]:
df.dropna(axis=1, how='all', inplace=True)
df.dropna(axis=0, how='any', inplace=True)
df.dropna(axis=0, thresh=2, inplace=True) # Mostly for rows, thresh: interesting

# For columns: count of null values are 60 to 70 percent of whole data
df.isnull().sum()*100/df.shape[0]

name                 0.0
gender               0.0
start_date           0.0
salary               0.0
bonus                0.0
senior_management    0.0
dtype: float64

# Data Imputation

In [26]:
# 1) logical rules
data = {'name': ['x', 'y', 'z'], 'id': [810195120, 810198112, 810199302], 'year': [95, 98, np.nan]}
data = pd.DataFrame(data)
display(data)

# 2) Imputation using a constant value: bias
df.fillna(0)

# 3) impuation using mean/median values: small dataset, low accuracy, not take to categorical 
df.salary.fillna(df.salary.mean)
df.salary.fillna(df.salary.median)

# 4) Interpolation
df.salary.interpolate(method='linear', axis=0) # polynomial

## 5) OTHERS LIKE:
# clustering, KNN, Hot-Deck imputation

  name         id  year
0    x  810195120  95.0
1    y  810198112  98.0
2    z  810199302   NaN

0      61933.0
9      43586.0
10    129460.0
Name: salary, dtype: float64

In [32]:
df = pd.read_csv('income.csv')
df.rename(columns={'hours-per-week': 'hours'}, inplace=True)
display(df.head(2))
df.income.unique()
df.race.value_counts() # Category counts
df.hours[df.race == 'White'].mean()
df.hours[(df.race == 'White') & (df.income == '>50k')].mean()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K

40.66016953211053

# Pivot table

In [38]:
pd.pivot_table(df, index=['race', 'gender'], columns=['income'], values=['hours'], aggfunc='mean')

                               hours
income                         <=50K       >50K
race               gender
Amer-Indian-Eskimo Female  36.682353  41.933333
                   Male    41.991837  44.375000
Asian-Pac-Islander Female  36.540179  41.797101
                   Male    39.009063  45.608824
Black              Female  36.795496  42.363636
                   Male    38.977869  44.788018
Other              Female  35.472222  42.727273
                   Male    40.537736  44.717949
White              Female  35.668960  40.457847
                   Male    40.936604  46.418423

# Groupby

In [41]:
df.groupby(by=['gender', 'income']).agg(['mean', 'count'])
# Analyze dataframe categorically

                    mean  count
gender income
Female <=50K   36.278999  14423
       >50K    42.219333   1769
Male   <=50K   37.248548  22732
       >50K    44.641863   9918

# Joining tables

In [47]:
df1 = pd.DataFrame({'A': ['A11', 'A12'],
                    'B': ['B11', 'B12'],
                    'C': ['C11', 'C12'],
                    'D': ['D11', 'D12']},
                    index=[0, 1])

df2 = pd.DataFrame({'A': ['A1', 'A2', 'A3'],
                    'B': ['B1', 'B2', 'B3'],
                    'C': ['C1', 'C2', 'C3'],
                    'D': ['D1', 'D2', 'D3']},
                    index=[1, 2, 3])

display(df1)
display(df2)

pd.concat([df1, df2])
pd.concat([df1, df2], axis=1, join='inner') #inner: commun, outer: all

     A    B    C    D
0  A11  B11  C11  D11
1  A12  B12  C12  D12

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

     A    B    C    D   A   B   C   D
1  A12  B12  C12  D12  A1  B1  C1  D1

# Merge

In [53]:
df1 = pd.DataFrame({'id': [81010, 81011, 81012, 81013],
                    'DA': [20, 15, 18.75, 10],
                    'SI': [16, 17, 20, 13],
                    'IL': [17, 13, 14, 11]})

df2 = pd.DataFrame({'id': [81011, 81012, 81013, 81014, 81015],
                    'GPA': [16.5, 18, 15, 19.3, 17.7],
                    'uni': ['A0', 'A1', 'A2', 'A3', 'A5']})

display(df1)
display(df2)

pd.merge(df1, df2, on='id', how='outer') # how: inner- common, outer, right-left: df position

      id     DA  SI  IL
0  81010  20.00  16  17
1  81011  15.00  17  13
2  81012  18.75  20  14
3  81013  10.00  13  11

      id   GPA uni
0  81011  16.5  A0
1  81012  18.0  A1
2  81013  15.0  A2
3  81014  19.3  A3
4  81015  17.7  A5

      id     DA    SI    IL   GPA  uni
0  81010  20.00  16.0  17.0   NaN  NaN
1  81011  15.00  17.0  13.0  16.5   A0
2  81012  18.75  20.0  14.0  18.0   A1
3  81013  10.00  13.0  11.0  15.0   A2
4  81014    NaN   NaN   NaN  19.3   A3
5  81015    NaN   NaN   NaN  17.7   A5

# Join

In [57]:
df1.set_index('id').join(df2, lsuffix='_left', rsuffix='_right') # Based on index

          DA  SI  IL  id  GPA  uni
id
81010  20.00  16  17 NaN  NaN  NaN
81011  15.00  17  13 NaN  NaN  NaN
81012  18.75  20  14 NaN  NaN  NaN
81013  10.00  13  11 NaN  NaN  NaN